# 由特定语法规则组成的文本模式，用来描述匹配字符串中符合规定规则的字符序列
# 正则操作的库

# import re
# s=""
# result=re.match(r"1[3-9]\d{9}",s) 从字符串的开头开始匹配 返回Match对象  没有则返回NONE
# 用 print(result.group())来输出
# re.search(r"1[3-9]\d{9}",s) 从任意开始 搜索第一个匹配的 返回对象
# re.findall(r"1[3-9]\d{9}",s)从任意位置开始 搜索所有匹配项 返回list对象
# r表示恢复原本含义 防止\表示为转义
# result.span()  获取匹配项的索引
# result.start()  分别表示匹配项的开始和结束索引
# result.end()

"""● 正则表达式的写法多种多样，具体的语法如下：

表达式          描述                                              表达式      描述
普通字符        字母、数字、汉字及大多数字符，直接匹配自身        *           出现任意次（0次或无数次）
.               匹配任意一个字符（除\n）                          +           至少出现1次（1次或无数次）
\d              匹配数字 0-9                                      ?           至多出现一次（0次或1次）
\D              匹配非数字                                        {m}         出现m次
\w              匹配单词字符，即a-z、A-Z、0-9、_、其他语言文字     {m,}        至少出现m次
\W              匹配非单词字符                                    {m,n}       出现m到n次
[aeiou]         匹配其中的任何单个字符                            或的意思，匹配左右任意一个表达式
[^aeiou]        求反，匹配不在字符列表中的任何单个字符            ()          分组，将括号里的多个字符视为一个单元
[0-5]           表示范围                                          ^           匹配字符串开头
                                                                  $           匹配字符串结尾
"""
import re

s1 = ("18809090000是我的手机号，188开头的，以00结尾的；我的另一个手机号是15500008888，"
      "两个QQ号分别是1259939092和13819091293821，邮箱为python666@163.com.")

# 正则表达式
# print(re.findall(r"188.*", s1))
# print(re.findall(r"188.?", s1))
# print(re.findall(r"188.+", s1))

# print(re.findall(r"188\d{8}", s1))
# print(re.findall(r"155\d{6,10}", s1))
# print(re.findall(r"155\d{6,}", s1))

# print(re.findall(r"1[38]\d{8}", s1))
# print(re.findall(r"1[^38]\d{8}", s1))
# print(re.findall(r"1[3-9]\d{8}", s1))
# print(re.findall(r"^1[3-9]\d{9}", s1))
# print(re.findall(r"^1[3-9]\d{9}$", s1))

# print(re.findall(r"\w+@\w+\.\w+", s1))

# 注意
s2 = "现在的时间是2026-02-06 10:05:25，今天的天气还可以，气温是28度 "
print(re.findall(r"\d{4}-\d{2}-\d{2}", s2))
print(re.findall(r"(\d{4})-(\d{2})-(\d{2})", s2))