"""
1、可变类型与不可变类型

不可变对象：一旦创建就不可修改的对象，包括字符串、元组、数值类型（整型、浮点型）

该对象所指向的内存中的值不能被改变。当改变某个变量时候，由于其所指的值不能被改变，相当于把原来的值复制一份后再改变，这会开辟一个新的地址，变量再指向这个新的地址。

可变对象：可以修改的对象，包括列表、字典、集合

该对象所指向的内存中的值可以被改变。变量（准确的说是引用）改变后，实际上是其所指的值直接发生改变，并没有发生复制行为，也没有开辟新的地址，通俗点说就是原地改变。
"""
# copy模块里的 copy()浅拷贝 deepcopy()深拷贝
# 深浅拷贝主要是针对于可变类型 深拷贝 拷贝所有层 浅拷贝只拷贝第一层
# 如果是针对不可变类型 其用法和普通赋值一样
import copy
def dm01_():#普通赋值
    #普通类型之不可变类型
    a = 10
    b = a
    print('id(a)-->', id(a))
    print('id(b)-->', id(b))
    print('id(10)-->', id(10))
    #普通赋值之可变类型
    a = [1, 2, 3]
    b = [11, 22, 33]
    c = [a, b]
    d = c
    print('id(c)-->', id(c))
    print('id(d)-->', id(d))
def dm02_():
    a = [1, 2, 3]
    b = [11, 22, 33]
    c = [6, 7, a, b]
    d = copy.copy(c)  # 浅拷贝
    print('id(c)→', id(c))
    print('id(d)→', id(d))
    # 测试2
    print(id(c[2]))
    print(id(a))
    # 修改a[2] = 22
    a[2] = 22
    # c[0] = 100
    print('c→', c)
    print('d→', d)
#深浅拷贝针对于不可变类型 用法和普通赋值一样
#对于不可变类型 无法开辟新空间 导致与普通一致
def dm03_():#浅拷贝对于不可变类型
    # 不可变类型 a b c
    a = (1, 2, 3)                     # 0x01
    b = (11, 22, 33)                  # 0x02
    c = (6, 7, a, b)                  # 0x03
    d = copy.copy(c)
    print('id(c)⟶', id(c))             # 0x03
    print('id(d)⟶', id(d))             # 0x03
#深拷贝拷贝的是其值 拷贝所有值：把所有可变类型都解析
def dm04_():#深拷贝可变类型
    a = [1, 2, 3]                     # 0x01
    b = [11, 22, 33]                  # 0x02
    c = [6, 7, a, b]                  # 0x03
    d = copy.deepcopy(c)              # 深拷贝
    print('id(c)⟶', id(c))             # 0x03
    print('id(d)⟶', id(d))             # 0x04
    a[1] = 100
    b[1] = 800
    print(f'c: {c}')
    print(f'd: {d}')
if __name__ == '__main__':
    dm01_()
    dm02_()
    dm03_()
    dm04_()