"""
闭包解释:
    概述:
        内部函数 使用了外部函数的变量，这种写法就称之为闭包.
    格式:
        def 外部函数名(形参列表):
            外部函数的(局部)变量

            def 内部函数名(形参列表):
                使用外部函数的变量

            return 内部函数名
    前提条件:
        1. 有嵌套.          外部函数嵌套内部函数
        2. 有引用.          内部函数使用外部函数的变量
        3. 有返回.          外部函数中，返回 内部函数(对象)

细节:
    1. 函数名 和 函数名() 是两个概念，前者表示 函数对象，后者表示 调用函数，获取返回值.
"""
def fun_outter(num1):
    def fun_inner(num2):
        print(f"{num1 / num2}")
    return fun_inner
fun_outter(20)(10)