步骤 Streamlit入门程序

1. 安装streamlit: pip install streamlit
2. 在python文件中引入streamlit模块
3. 基于streamlit中提供的API来构建Web应用
4. 运行程序: streamlit run xxxx.py  #文件名
"""
import streamlit as st

# 标题
st.title("AI智能伴侣")

# 段落
st.write("布偶猫是一种源于美国的大型半长毛猫，以温顺黏人的“小狗猫”性格、湛蓝色的眼睛和松弛柔软的抱感著称，拥有重点色、手套色和双色等经典图案，需要定期梳毛并注意遗传性心脏病等健康问题，是理想的家庭陪伴宠物。")

# 图片
st.image("cat.jpg")

# 分隔线
st.divider()

# 表格
data = {"姓名": ["王林", "李慕婉", "贝罗", "莫厉海", "石萧", "红蝶", "十三"],
        "学号": ["20230001", "20230002", "20230003", "20230004", "20230005", "20230006", "20230007"],
        "语文": [80, 90, 85, 70, 95, 90, 85],
        "数学": [87, 92, 87, 81, 92, 69, 83],
        "英语": [90, 85, 90, 95, 80, 85, 90],
        "总分": [257, 267, 262, 246, 267, 244, 258]}
"""