a="""
IP地址可以理解为就是设备在互联网中的地址（唯一身份证，）
每个连入网络的设备都有一个自己的IP地址
用来定位设备在互联网中的位置
xxx.xx.xx.xxx
IPv4类型：32位二进制
每一段代表8位二进制 最大数为256
所以每一位只能0~255
127.0.0.1 代表本机的地址
IPv6：128位二进制组成

通过交换机来连接

域名 降低IP地址的记忆难度
通过DNS域名服务器来将域名和IP地址相互映射
端口号 表示计算机设备运行中的程序0~65535
http默认端口号是80 https默认443
"""
b="""
网络模型
OSI网络模型 全球网络互联标准模型
七层 应用层 表示层 会话层 传输层 网络层 数据链路层 物理层
TCP/IP网络模型 OSI的简化版
四层
应用层 HTTP FTP SHTP
    将用户与应用程序交互的数据按照协议格式运行封装
传输层 UDP保证实时性 TCP保证可靠性
    负责将数据准确送到对应程序 端口
网络层 IP
    负责基于IP地址将数据包路由给对应设备
网络接口层
    负责在物理网络中的传输，处理与硬件设备交互
"""