"""
张量的索引
    简单行列索引
    列表索引
    范围索引
    布尔索引
    多维索引
"""
import torch

#创建随机种子
torch.manual_seed(40)

#创建随机变量
t1=torch.randint(1,10,(5,5))
print(f"t1:{t1}")
# 1 简单行列索引 格式 张量[行：列]—--> 张量[[行索引]：[列索引]]
#行列数量要匹配
    #获取第二行的数据
print(t1[1])
print(t1[1,:])#效果和上述相同  ：表示所有列
print(t1[:,2])#表示所有行的第三列数据

# 2 列表索引
    #返回(0,1)(1,2)两个位置的张量数据
print(t1[[0,1],[1,2]])

print(t1[[1,3],[2,4]])#表示1和2进行匹配 3和4 进行匹配

#拿取前面所有行的索引 与所有列进行匹配
print(t1[[[0],[1]],[1,2]])
# 3 范围索引
    #返回前三行 前两列
print(t1[:3,:2])
    #第二行到最后一行，前两列的数据
print(t1[1:,:2])
    #所有奇数行，偶数列
print(t1[1::2,::2])
# 4 布尔索引
# print(t1[torch.tensor([True,False,False,False,True]),:])  #基本布尔值的运用
    #输出第三列 大于五的行数据
print(t1)
# 5 多维索引